app/views/tasks/create.js.erb

INSERT INTO "tasks" ("created_at", "updated_at", "title", "deadline", "category_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["created_at", "2019-08-29 12:28:20.029007"], ["updated_at", "2019-08-29 12:28:20.029007"], ["title", "azzzzzzzz"], ["deadline", "2019-08-30 00:00:00"], ["category_id", 1]]
---
alert("creer le task en ajax");
document.getElementById("<%=@category.id%>").insertAdjacentHTML("beforeend", "<%= j render 'task', task: @task %>")