app/controllers/tasks_controller.rb

  def update
    @task = Task.find(params[:id])
    @task.update(task_params)
---
SELECT "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
UPDATE "tasks" SET "deadline" = $1, "updated_at" = $2 WHERE "tasks"."id" = $3  [["deadline", nil], ["updated_at", "2019-08-29 17:34:25.949917"], ["id", 7]]