app/views/emails/create.js.erb

INSERT INTO "emails" ("object", "body", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["object", "berry@jaskolski.biz"], ["body", "Hotel California"], ["created_at", "2019-08-30 01:44:08.153970"], ["updated_at", "2019-08-30 01:44:08.153970"]]
---
alert("Vous êtes creer les email !")
document.getElementById("emails-list").insertAdjacentHTML("beforeend","<%= j render 'email', email:@email%>")